Revit 2027 API
BuiltInFailures.SketchFailures.SculptingCurvesCannotFormClosedLoop Property
 Curves cannot form a closed loop.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SculptingCurvesCannotFormClosedLoop { get; }
Public Shared ReadOnly Property SculptingCurvesCannotFormClosedLoop As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SculptingCurvesCannotFormClosedLoop {
	FailureDefinitionId^ get ();
}
static member SculptingCurvesCannotFormClosedLoop : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace